#define _CRT_SECURE_NO_WARNINGS //必须将该行代码放置最顶端否则仍会报错
// scanf被认为不安全而被编译器(仅限于VS)默认禁用
// 一劳永逸解决方法:VS创建新项目时默认拷贝newc++file.cpp文件, 只需修改该文件加上上述代码即可自动复制粘贴(权限不足可先保存到桌面再转回文件夹)(但在添加新建项时需使用"显示所有模板")
// VS中认为CRT中的一组函数如果使用不当，可能会产生诸如内存泄露、缓冲区溢出、非法访问等安全问题
#pragma warning(disable:4996) // 用此方法进行警告禁用
#include <stdio.h>

int main()
{
	printf("小明: %d分\n小红: %d分\n", 120, 130); // %d作为占位符以使其他值代入; %d仅输入整数, 即在输入小数(只读取到整数部分)的情况下仍能进行读取(并判断为真)
	printf("我玩『%s』怎么你了?\n", "原神"); // %s被字符串取代
	printf("练习时长%1.1f年\n", 2.5); // 占位符%f被取代]
	printf("输出百分号%%\n"); // "%%" → %
	printf("%d\n", 255); // 打印数字255(十进制)
	printf("%o\n", 255); // 打印数字255(十进制转八进制)
	printf("%x\n", 255); // 打印数字255(十进制转十六进制(小写))
	printf("%X\n", 255); // 打印数字255(十进制转十六进制(大写))
	printf("%#d\n", 255); // 打印数字255(十进制)(无标识)
	printf("%#o\n", 255); // 打印数字255(十进制转八进制)(#进行进制标识)
	printf("%#x\n", 255); // 打印数字255(十进制转十六进制(小写))(#进行进制标识)
	printf("%#X\n", 255); // 打印数字255(十进制转十六进制(大写))(#进行进制标识)
	printf("%5d\n", 123); // %5d:打印最小宽度为5(默认向右对齐)
	printf("%-5d啊哈\n", 123); // %-5d:向左对齐
	printf("%+d\n", 123); // %+d:使打印出的正整数带+号
	printf("%5d\n", 123456); // 超过或等于设定最小宽度正常打印
	printf("%f\n", 3.14); // 默认为double类型, %f & %lf 默认打印至小数点后6位
	printf("%3.2f\n", 3.14); // %3.2f:打印最小宽度为3(可省略),打印至小数点后2位
	printf("%*.*f\n", 3, 2, 3.14); // *,*被3,2取代(*将最小宽度和小数位数两个限定值通过printf()的参数传入)
	printf("%.3s\n", "abcdef"); // %.3s:打印字符串的前三个字符

	int score = 0;
	printf("请输入成绩:");
	// scanf函数存在int类型的返回值, 可用int return1 = scanf()的形式消除报错
	// scanf函数的占位符除%c以外均会忽略起首的所有空白字符(空格), %c总是返回第一个字符(无论是否为空格)
	scanf("%d", &score); // 键盘输入指令; scanf函数中占位符后需要的参数为地址, &为取地址操作符
	printf("成绩为:%d\n", score);

	int Chinese, Math = 0;
	printf("语文和数学分别考多少分?");
	scanf("%d, %d", &Chinese, &Math); // 如果使用,来分隔输入的%d, 则输入时也需要依照前文格式添加,, 否则无法得到输入结果
	printf("语文:%d分, 数学:%d分\n", Chinese, Math);

	int English, Physics = 0;
	printf("英语和物理分别考多少分?");
	scanf("%d%*c%d", &English, &Physics); // 此处*作为赋值忽略符, %*c可忽略输入的数据间的字符
	printf("英语:%d分, 物理:%d分\n", English, Physics);

	// C语言中进行字符型(char型)变量输入时, 若存在连续输入, 则上一输入结果的回车符会存储于缓存中并赋给下一char型变量 \
	   从而导致流程非法, 无法进行键盘输入操作
	while (getchar() != '\n'); // 循环读入字符直至回车符, 可清除缓存中的回车符
	char character;
	printf("请输入任意字符:");
	scanf(" %c", &character); // " %c":%c前加上空格可忽略输入的起首所有空白字符(空格)
	printf("字符为:%c\n", character);

	char arr[20] = {0}; // array:数组, 阵列; []内指定元素数目, {}内数目不得超过[]中规定数目, 若省略数组大小则默认为初始化时的元素个数
	while (getchar() != '\n');
	printf("请输入一段字符串(限制为5):");
	scanf("%5s", arr); // arr为数组名, 无需在其前面加上&; %5s:限制输入字符串的最大长度为5
	// %s中不包含空白字符(空格, 换行符, 制表符等), 当检测到空白字符时输入终止, 所以scanf()不适合读取包含空格的字符串
	// scanf()遇到%s时会自动在字符串末尾处存储空字符\0(终止字符)
	// scanf()将字符串读入字符数组时, 不会检测字符串是否超过数组长度, 当超过时会报错(因而scanf函数不安全); 为防止这种情况,应当指定输入字符串的最大长度
	printf("字符串为:%s\n", arr);


	return 0;
}