#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
#include <windows.h>

int main()
{
	// array:数组
	// type arr_name[]; []内应为一常量值, 进行数组元素个数的指定(可忽略, 以初始化元素个数为数组的元素个数)
	// C99之后引入"变长数组"的概念, 可以使用变量规定数组的大小(但是VS2022不支持该功能!!!)(可使用Dev-C++/小熊猫C++等底层使用gcc编译器的软件实现该功能)
	// 数组是一组相同类型元素的集合, 数组元素个数不能为0
	// 数组分为一维数组和多维数组(多为二维数组)
	// 数组初始化时需使用{}, 若不一一列举各个元素则称为不完全初始化, 剩余元素默认初始化为0, 但初始化元素个数不可超过[]内设定的数字
	// 数组初始化后无法直接进行整体重新赋值, 只可通过逐个修改元素的值来改变数组内容
	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
	// 字符数组(char)初始化时可以用形如"abc"的方法进行初始化
	char ch[] = "abcdefg";
	// 数组的类型是其中元素类型+[常量]; (e.g.) 上面arr的类型为:int[10]
	// 数组名本身即代表了数组的起始地址, 但是数组元素不是地址, 所以在输入数组元素时仍需要取地址符&

	int i = 0;
	int input[10] = { 0 };
	// 数组中存在下标(即序号), 下标从0开始: 0, 1, 2, ...
	printf("数组arr的第六个数字为:　%d\n", arr[5]); // 此处的[]为下标引用操作符, 取出数组中下标为5的数字(即第6个)
	printf("请为input数组输入十个数:");
	for (i = 0; i < 10; i++)
	{
		scanf("%d%*c", &input[i]); // 此处需用&和[]来对数组中元素依次进行输入
	}

	printf("数组input的元素依次为:\n");
	for (i = 0; i < 10; i++)
	{
		printf("%d ", input[i]);
		// 数组在内存中是连续存放的(1个int类型的值占4个字节)
		printf("\t取地址&arr[%d] = %p\n", i, &arr[i]); // \t: 水平制表符; %p: 打印地址
	}
	printf("\n");

	// sizeof:C语言中的一个关键字, 可以计算类型、变量、数组等的大小, 返回无符号整数类型size_t的值
	printf("数组arr的长度为%zd(单位:字节byte)\n", sizeof(arr)); // 64位环境下打印size_t的值需用%zd
	printf("数组arr中元素的个数为%zd\n\n", sizeof(arr) / sizeof(arr[0])); // 元素个数 = 数组长度 / 数组中元素长度


	// 二维数组: 数组中的元素为一维数组(嵌套); 三维数组同理
	// type arr_name[常量值1][常量值2]; 二维数组定义方法[行][列]
	// 二维数组在进行初始化时可以省略行(即第一个[]内的常量), 但不能省略列(即第二个[]内的常量)
	int data_1[3][5] = { 0 }; // 不完全初始化
	int data_2[5][4] = { {1,3,5}, {2,4,6} }; // 按行进行初始化
	int data_3[][5] = { {1,2}, {3,4}, {5,6,7,8} }; // 第二个[]内的数字不可省略

	// 二维数组输入
	int arr2[3][4] = {0};
	printf("请为一个三行四列的数组输入其中元素: \n");
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 4; j++)
			scanf("%d", &arr2[i][j]);
	}
	// 二维数组输出
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 4; j++)
			printf("%d ", arr2[i][j]);
		printf("\n");
	}
	printf("\n");

	
	// 字符数组输出小练
	char str[] = "hello bit!!!!!!!!!"; // 注意字符串末尾自动添加上终止字符'\0'
	char sign[] = "##################";
	int len = (int)strlen(str); // <string.h>头文件函数: 使用strlen()而非sizeof()可避免计入'\0'的长度
	for (int i = 0, j = len - 1; i <= j+1; i++, j--)
	{
		for (int l = 0; l < len; l++)
			printf("%c", sign[l]);
		printf("\n");
		sign[i] = str[i];
		sign[j] = str[j];
	}

	return 0;
}